Mrunmoy/HelixDrift/zephyr_apps/nrf52840-mocap-bridge/src/main.cpp
#include <zephyr/device.h>
#include <zephyr/devicetree.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/nrf_clock_control.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/sys/atomic.h>
#include <zephyr/sys/printk.h>
#include <zephyr/sys/reboot.h>
#include <zephyr/types.h>
#include <string.h>

#include <esb.h>

#include "usbd_init.h"
#include "ota_hub_relay.hpp"

#if defined(CONFIG_BT)
#include <zephyr/bluetooth/bluetooth.h>
#endif

#if defined(CONFIG_BT) && defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
#include <zephyr/bluetooth/conn.h>
#include <zephyr/bluetooth/gatt.h>
#include <zephyr/devicetree/fixed-partitions.h>
#include <zephyr/dfu/mcuboot.h>
#include <pm_config.h>
#include <zephyr/storage/flash_map.h>

#include "BleOtaService.hpp"
#include "IOtaManager.hpp"
#include "OtaManager.hpp"
#include "OtaTargetIdentity.hpp"
#include "ZephyrOtaFlashBackend.hpp"
#endif

LOG_MODULE_REGISTER(helix_mocap_bridge, LOG_LEVEL_INF);

enum {
	HELIX_PACKET_SYNC_ANCHOR = 0xA1,
	HELIX_PACKET_MOCAP_FRAME = 0xC1,
	HELIX_PACKET_OTA_TRIGGER = 0xE1,
};

/* Magic value to prevent accidental OTA triggers. Must match on both sides. */
static constexpr uint32_t kOtaTriggerMagic = 0xDEADBEEFu;

struct __packed HelixSyncAnchor {
	uint8_t type;
	uint8_t central_id;
	uint8_t anchor_sequence;
	uint8_t session_tag;
	uint32_t central_timestamp_us;
	/* v2+: flags byte. bit0 = tell target tag to reboot into BLE OTA
	 * window. Anchors of the OLD 8-byte size are still accepted
	 * (flags defaults to 0 when absent). */
	uint8_t flags;
	/* v3+: target node_id for OTA trigger. Needed because Hub now
	 * FLOODS the OTA_REQ flag in every anchor during the trigger window
	 * (not just the target's ACKs) — so each receiving Tag must be able
	 * to tell whether the flag is for it. 0xFF = broadcast (all nodes).
	 * Tags that see the old 9-byte anchor (no target_id field) treat
	 * the OTA_REQ flag as broadcast — preserves legacy single-target
	 * behaviour for fleets that haven't migrated to v3 anchors yet. */
	uint8_t ota_target_node_id;
};

static constexpr uint8_t HELIX_ANCHOR_FLAG_OTA_REQ = 0x01u;

struct __packed HelixOtaTrigger {
	uint8_t type;           /* HELIX_PACKET_OTA_TRIGGER */
	uint8_t central_id;
	uint8_t target_node_id; /* 0xFF = broadcast */
	uint8_t session_tag;
	uint32_t magic;         /* kOtaTriggerMagic */
};

struct __packed HelixMocapFrame {
	uint8_t type;
	uint8_t node_id;
	uint8_t sequence;
	uint8_t session_tag;
	uint32_t node_local_timestamp_us;
	uint32_t node_synced_timestamp_us;
	int16_t yaw_cdeg;
	int16_t pitch_cdeg;
	int16_t roll_cdeg;
	int16_t x_mm;
	int16_t y_mm;
	int16_t z_mm;
};

struct HelixMocapStatus {
	uint32_t magic;
	uint32_t role;
	uint32_t heartbeat;
	uint32_t phase;
	uint32_t tx_attempts;
	uint32_t tx_success;
	uint32_t tx_failed;
	uint32_t rx_packets;
	uint32_t anchors_sent;
	uint32_t anchors_received;
	uint32_t usb_lines;
	uint32_t tracked_nodes;
	int32_t estimated_offset_us;
	uint32_t last_node_id;
	uint32_t last_sequence;
	uint32_t last_rx_len;
	uint32_t last_error;
};

struct NodeTrack {
	uint8_t node_id;
	bool active;
	uint32_t packets;
	uint32_t gaps;
	uint8_t last_sequence;
	uint32_t last_node_timestamp_us;
	uint32_t last_synced_timestamp_us;
	uint32_t last_rx_timestamp_us;
};

volatile struct HelixMocapStatus g_helixMocapStatus;

/* ── Persistent node_id (flash-backed) ──────────────────────────────
 *
 * Single firmware binary for all 10 Tags. Each Tag's unique node_id is
 * stored in the first word of the settings_storage partition at 0xFE000
 * (we have CONFIG_SETTINGS=n so that 8 KB page is otherwise unused).
 *
 * Layout: [node_id:u8][0xFF:u8][0xFF:u8][0xFF:u8]
 *   lower byte = node_id (1..255); sentinel 0xFFFFFFFF = unprovisioned.
 *
 * Provisioning (SWD): after `nrfutil device program` (which erases the
 * whole flash, so this word ends up as 0xFFFFFFFF), write the node_id:
 *   nrfutil device write --address 0xFE000 --value 0xFFFFFF<nn> --direct
 *
 * If unprovisioned, we fall back to CONFIG_HELIX_MOCAP_NODE_ID so dev
 * workflow still works on a single Tag.
 *
 * OTA never touches this page (MCUboot overwrite-only only writes
 * mcuboot_secondary at 0x85000-0xFE000), so node_id persists forever
 * after provisioning.
 */
static constexpr uint32_t kHelixConfigAddr = 0xFE000u;
#if defined(PM_SETTINGS_STORAGE_ADDRESS)
static_assert(kHelixConfigAddr == PM_SETTINGS_STORAGE_ADDRESS,
              "node_id flash address must match settings_storage partition base");
#endif
static uint8_t g_node_id = (uint8_t)CONFIG_HELIX_MOCAP_NODE_ID;

static uint8_t helix_load_node_id(void)
{
	const uint32_t val = *reinterpret_cast<const volatile uint32_t *>(kHelixConfigAddr);
	if (val == 0xFFFFFFFFu) {
		return (uint8_t)CONFIG_HELIX_MOCAP_NODE_ID;
	}
	const uint8_t id = (uint8_t)(val & 0xFFu);
	if (id == 0u) {
		return (uint8_t)CONFIG_HELIX_MOCAP_NODE_ID;
	}
	return id;
}

static const struct gpio_dt_spec led = GPIO_DT_SPEC_GET_OR(DT_ALIAS(led0), gpios, {0});
static const struct device *const host_stream = DEVICE_DT_GET(DT_CHOSEN(zephyr_console));
static struct esb_payload rx_payload;
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
static struct esb_payload tx_payload;
static atomic_t tx_ready = ATOMIC_INIT(1);
static bool have_anchor;
static int32_t estimated_offset_us;
/* Set from ESB ISR when an OTA trigger arrives; main loop reboots. */
static atomic_t ota_reboot_pending = ATOMIC_INIT(0);
#endif
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
static struct NodeTrack tracked_nodes[CONFIG_HELIX_MOCAP_MAX_TRACKED_NODES];
static uint8_t next_anchor_sequence;
/* When non-zero, the central injects an OTA trigger into the next ACK
 * payload for the target node (0xFF = broadcast). Cleared after send. */
static volatile uint8_t ota_trigger_target_node;
static volatile uint8_t ota_trigger_retries;
static volatile uint32_t ota_triggers_sent;

/* Request an OTA trigger for a specific node (or 0xFF = broadcast).
 * Sends the trigger on the next few FRAMEs from the target, then clears.
 * Called from the Hub relay when the PC requests a remote OTA trigger.
 *
 * Tear-down first, then arm. The ESB RX ISR reads ota_trigger_target_node
 * and ota_trigger_retries as an implicit pair; if we raced the two volatile
 * writes in the wrong order, the ISR could read the new target against the
 * old retries (or vice versa) and either send a stale flood or skip a new
 * one. Gate on target_node=0, barrier, then arm retries + target. The DMBs
 * force ordering on Cortex-M4 — cheap and sufficient since the ISR is on
 * the same core. (Copilot code review, 2026-04-20.) */
extern "C" void helix_request_ota_trigger(uint8_t node_id, uint8_t retries)
{
	ota_trigger_target_node = 0u;  /* gate: ISR ignores trigger during update */
	__DMB();
	ota_trigger_retries = retries;
	__DMB();
	ota_trigger_target_node = node_id;  /* arm */
}
#endif

static uint32_t now_us(void)
{
	return (uint32_t)(k_uptime_get() * 1000LL);
}

