Mrunmoy/HelixDrift/zephyr_apps/nrf52840-mocap-bridge/src/main.cpp
	/* If we get here without reboot, OTA was aborted or stalled */
	printk("ota: session ended without commit, switching to ESB\n");
	bt_le_adv_stop();
	bt_disable();
	return false;
}

#endif /* CONFIG_BT && ROLE_NODE && BOOT_WINDOW > 0 */

int main(void)
{
	int err;

	/* Resolve node_id from flash first so every subsequent subsystem
	 * (ESB init, logging, OTA trigger filter) sees the provisioned value. */
	g_node_id = helix_load_node_id();

	memset((void *)&g_helixMocapStatus, 0, sizeof(g_helixMocapStatus));
	g_helixMocapStatus.magic = 0x484D4244U;
	g_helixMocapStatus.role =
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
		1U;
#else
		2U;
#endif
	g_helixMocapStatus.phase = 1U;

	if (gpio_is_ready_dt(&led)) {
		(void)gpio_pin_configure_dt(&led, GPIO_OUTPUT_INACTIVE);
	}

	err = clocks_start();
	if (err) {
		status_set_error(err);
	}
	g_helixMocapStatus.phase = 2U;

	err = host_stream_init();
	if (err) {
		status_set_error(err);
	}
	g_helixMocapStatus.phase = 3U;

#if defined(CONFIG_HELIX_OTA_HUB_RELAY)
	ota_hub_relay_init(host_stream);
#endif

#if defined(CONFIG_BOARD_PROMICRO_NRF52840_NRF52840)
	/* NCS v3.2.4 UARTE legacy shim PSEL.TXD workaround */
	{
		volatile auto *pselTxd = reinterpret_cast<volatile uint32_t *>(0x40002508U);
		if (*pselTxd == 0xFFFFFFFFU) {
			*pselTxd = 9U;
		}
	}
#endif

	/* ── BLE OTA boot window (node only) ────────────────── */
#if defined(CONFIG_BT) && defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE) && \
    (CONFIG_HELIX_OTA_BOOT_WINDOW_MS > 0)
	run_ota_boot_window();
	/* If we return here, OTA either wasn't requested or was aborted.
	 * bt_disable() was called. Proceed to ESB. */
#endif

	/* ── Release BLE/MPSL before ESB ──────────────────── */
#if defined(CONFIG_BT)
	/* Both Hub and Tag need bt_enable()+bt_disable() before esb_init()
	 * to properly cycle MPSL resources. The SoftDevice Controller's
	 * SYS_INIT claims TIMER0/RTC0/RADIO. bt_disable() with
	 * CONFIG_BT_UNINIT_MPSL_ON_DISABLE releases them for ESB. */
#if !defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE) || \
    !(CONFIG_HELIX_OTA_BOOT_WINDOW_MS > 0)
	{
		int bt_err = bt_enable(nullptr);
		if (bt_err == 0 || bt_err == -EALREADY) {
			bt_disable();
			printk("ble/mpsl released for esb\n");
		}
	}
#endif
#endif

	/* ── ESB mocap mode ─────────────────────────────────── */
	err = esb_initialize();
	if (err) {
		status_set_error(err);
	}
	g_helixMocapStatus.phase = 4U;

#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
	err = esb_start_rx();
	if (err) {
		status_set_error(err);
	}
#endif

	host_write("HELIX_MOCAP_BRIDGE_READY\n");

	static bool esb_running = true;

	while (1) {
		heartbeat_tick();

#if defined(CONFIG_HELIX_OTA_HUB_RELAY)
		/* Check if OTA relay needs to stop ESB */
		if (esb_running && ota_hub_relay_needs_esb_stop()) {
			printk("hub: stopping ESB for OTA relay\n");
			esb_disable();
			k_sleep(K_MSEC(100)); /* let radio peripheral settle */
			esb_running = false;
		}

		/* Poll OTA relay (processes USB RX, drives BLE state machine) */
		ota_hub_relay_poll();

		/* Check if OTA session ended and ESB can restart */
		if (!esb_running && ota_hub_relay_esb_can_restart()) {
			printk("hub: restarting ESB after OTA relay\n");
			esb_initialize();
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
			esb_start_rx();
#endif
			esb_running = true;
			host_write("HELIX_MOCAP_BRIDGE_READY\n");
		}
#endif

#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
		/* Handle deferred OTA reboot triggered from ESB ISR */
		if (atomic_cas(&ota_reboot_pending, 1, 0)) {
			printk("ota: ESB trigger received, rebooting\n");
			k_sleep(K_MSEC(50));
			sys_reboot(SYS_REBOOT_COLD);
		}
		maybe_send_frame();
#endif
		if ((g_helixMocapStatus.heartbeat % 25U) == 0U) {
			report_summary();
		}
		k_sleep(K_MSEC(CONFIG_HELIX_MOCAP_SEND_PERIOD_MS));
	}

	return 0;
}
